In [1]:
import pandas as pd
import MySQLdb

In [2]:
db = MySQLdb.connect(
    'localhost',
    'root',
    '1234',
    'employees',
    charset = 'utf8'
)

In [3]:
df = pd.read_sql('select * from employees', db)
df.head()

   emp_no  birth_date first_name last_name gender   hire_date
0   10001  1953-09-02     Georgi   Facello      M  1986-06-26
1   10002  1964-06-02    Bezalel    Simmel      F  1985-11-21
2   10003  1959-12-03      Parto   Bamford      M  1986-08-28
3   10004  1954-05-01  Chirstian   Koblick      M  1986-12-01
4   10005  1955-01-21    Kyoichi  Maliniak      M  1989-09-12

In [4]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 300024 entries, 0 to 300023
Data columns (total 6 columns):
emp_no        300024 non-null int64
birth_date    300024 non-null object
first_name    300024 non-null object
last_name     300024 non-null object
gender        300024 non-null object
hire_date     300024 non-null object
dtypes: int64(1), object(5)
memory usage: 13.7+ MB

In [5]:
df.index = df['emp_no']
df.head()

        emp_no  birth_date first_name last_name gender   hire_date
emp_no
10001    10001  1953-09-02     Georgi   Facello      M  1986-06-26
10002    10002  1964-06-02    Bezalel    Simmel      F  1985-11-21
10003    10003  1959-12-03      Parto   Bamford      M  1986-08-28
10004    10004  1954-05-01  Chirstian   Koblick      M  1986-12-01
10005    10005  1955-01-21    Kyoichi  Maliniak      M  1989-09-12

In [6]:
df = df.drop('emp_no', axis=1)

In [7]:
df.head()

        birth_date first_name last_name gender   hire_date
emp_no
10001   1953-09-02     Georgi   Facello      M  1986-06-26
10002   1964-06-02    Bezalel    Simmel      F  1985-11-21
10003   1959-12-03      Parto   Bamford      M  1986-08-28
10004   1954-05-01  Chirstian   Koblick      M  1986-12-01
10005   1955-01-21    Kyoichi  Maliniak      M  1989-09-12

In [8]:
df.columns = ['생년월일', '성','이름', '성별', '고용일']
df.head()

              생년월일          성        이름 성별         고용일
emp_no
10001   1953-09-02     Georgi   Facello  M  1986-06-26
10002   1964-06-02    Bezalel    Simmel  F  1985-11-21
10003   1959-12-03      Parto   Bamford  M  1986-08-28
10004   1954-05-01  Chirstian   Koblick  M  1986-12-01
10005   1955-01-21    Kyoichi  Maliniak  M  1989-09-12

In [9]:
df['fullname'] = df['이름']+" " +df['성']
df= df.drop(['성','이름'], axis=1)
df.head()

              생년월일 성별         고용일           fullname
emp_no
10001   1953-09-02  M  1986-06-26     Facello Georgi
10002   1964-06-02  F  1985-11-21     Simmel Bezalel
10003   1959-12-03  M  1986-08-28      Bamford Parto
10004   1954-05-01  M  1986-12-01  Koblick Chirstian
10005   1955-01-21  M  1989-09-12   Maliniak Kyoichi

In [10]:
df.groupby('성별')